<?php

use App\products;
use Illuminate\Database\Seeder;

class productTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        products::insert([
            'Product_name' => 'هدفون',
            'category_id' => 1,
            'manufacture_id' => 1,
            'Product_short_description' => 'اگر شما در طول روز تماس‌های زیادی دارید و استفاده از گوشی برایتان مقدور نیست، نیاز به هندزفری با کیفیت دارید. هندزفری بلوتوث مدل i7 با طراحی زیبا انتخاب مناسبی برای شما است. این کالا در رنگ طلایی و با الهام گرفتن از ایرپاد اپل طراحی شده است. این هندزفری علاوه بر قابلیت مکالمه تلفنی، به شما امکان کنترل صدا و پخش موسیقی را هم می‌دهد. با استفاده از بلوتوث این محصول به گوشی هوشمند‌تان متصل می‌شود',
            'Product_long_description' => 'امروزه هدفون‌ها با طراحی‌های متفاوت روانه‌ی بازار می‌شوند و ازآنجایی‌که ایرپاد‌های اپل دراین‌بین طرفداران بسیار را به‌سوی خود جلب کرده، شرکت‌های چینی برای جذب مشتری، از روی آن کپی برداری کردند؛ یکی از مدل‌هایی که از اپل ایرپاد کپی‌برداری شده، i7 است. این هدفون برخلاف مدل i7 TWS، یک گوشی دارد. هدفون‌ها بسته به شرایط هر شخص مدت استفاده‌ی متفاوتی دارند و احتمال دارد برخی افراد مدت‌زمان زیادی از آن استفاده کنند و ازاین‌رو طراحی ارگونومیک بسیار حائز اهمیت است. هدفون i7 با بدنه‌ای پلاستیکی، وزن 5 گرمی دارد و در استفاده‌های طولانی‌مدت کاربر را خسته نمی‌کند. این هدفون از نوع توگوشی است و آن به‌طور کامل در داخل گوش قرار می‌گیرد؛ طراحی ارگونومیک باعث شده تا این هدفون‌ به‌راحتی از گوش خارج نشونوزن این کالا 5 گرم است و در استفاده‌های طولانی مدت شما را خسته نخواهد کرد. مدت زمان نگهداری شارژ در حالت اس.',
            'Product_price' => 4800,
            'Product_image' => 'image/ijpEXLEz8Eay11K25tPR.jpg',
            'Product_size' => 'small',
            'color_id' => 1,
            'recommended' => 1,
            'Product_status' => 1,
        ]);
        products::insert([
            'Product_name' => 'پودر',
            'category_id' => 1,
            'manufacture_id' => 6,
            'Product_short_description' => ' با استفاده از بلوتوث این محصول به گوشی هوشمند‌تان متصل می‌شود',
            'Product_long_description' => 'امروزه هدفون‌ها با طراحی‌های متفاوت روانه‌ی بازار می‌شوند و ازآنجایی‌که ایرپاد‌های اپل دراین‌بین طرفداران بسیار را به‌سوی خود جلب کرده، شرکت‌های چینی برای جذب مشتری، از روی آن کپی برداری کردند؛ یکی از مدل‌هایی که از اپل ایرپاد کپی‌برداری شده، i7 است. این هدفون برخلاف مدل i7 TWS، یک گوشی دارد. هدفون‌ها بسته به شرایط هر شخص مدت استفاده‌ی متفاوتی دارند و احتمال دارد برخی افراد مدت‌زمان زیادی از آن استفاده کنند و ازاین‌رو طراحی ارگونومیک بسیار حائز اهمیت است. هدفون i7 با بدنه‌ای پلاستیکی، وزن 5 گرمی دارد و در استفاده‌های طولانی‌مدت کاربر را خسته نمی‌کند. این هدفون از نوع توگوشی است و آن به‌طور کامل در داخل گوش قرار می‌گیرد؛ طراحی ارگونومیک باعث شده تا این هدفون‌ به‌راحتی از گوش خارج نشون در حالت اس.',
            'Product_price' => 585200,
            'Product_image' => 'image/0ebDk6kl3mtECB0VK7Dr.jpg',
            'Product_size' => 'small',
            'color_id' => 1,
            'recommended' => 1,
            'Product_status' => 1,
        ]);
        products::insert([
            'Product_name' => 'گوشی سامسونگ',
            'category_id' => 1,
            'manufacture_id' => 1,
            'Product_short_description' => 'اگر شما در طول روز تماس‌های زیادی دارید و استفاده از گوشی برایتان مقدور نیست، نیاز به هندزفری با کیفیت دارید. هندزفری بلوتوث مدل i7 با طراحی زیبا انتخاب مناسبی برای شما است. این کالا در رنگ طلایی و با الهام گرفتن از ایرپاد اپل طراحی شده است. این هندزفری علاوه بر قابلیت مکالمه تلفنی، به شما امکان کنترل صدا و پخش موسیقی را هم می‌دهد. با استفاده از بلوتوث این محصول به گوشی هوشمند‌تان متصل می‌شود',
            'Product_long_description' => 'امروزه هدفون‌ها با طراحی‌های متفاوت روانه‌ی بازار می‌شوند و ازآنجایی‌که ایرپاد‌های اپل دراین‌بین طرفداران بسیار را به‌سوی خود جلب کرده، شرکت‌های چینی برای جذب مشتری، از روی آن کپی برداری کردند؛ یکی از مدل‌هایی که از اپل ایرپاد کپی‌برداری شده، i7 است. این هدفون برخلاف مدل i7 TWS، یک گوشی دارد. هدفون‌ها بسته به شرایط هر شخص مدت استفاده‌ی متفاوتی دارند و احتمال دارد برخی افراد مدت‌زمان زیادی از آن استفاده کنند و ازاین‌رو طراحی ارگونومیک بسیار حائز اهمیت است. هدفون i7 با بدنه‌ای پلاستیکی، وزن 5 گرمی دارد و در استفاده‌های طولانی‌مدت کاربر را خسته نمی‌کند. این هدفون از نوع توگوشی است و آن به‌طور کامل در داخل گوش قرار می‌گیرد؛ طراحی ارگونومیک باعث شده تا این هدفون‌ به‌راحتی از گوش خارج نشونوزن این کالا 5 گرم است و در استفاده‌های طولانی مدت شما را خسته نخواهد کرد. مدت زمان نگهداری شارژ در حالت اس.',
            'Product_price' => 7800,
            'Product_image' => 'image/GnLJ9VdgCXzTcM2VmAVn.jpg',
            'Product_size' => 'small',
            'color_id' => 1,
            'recommended' => 1,
            'Product_status' => 1,
        ]);
        products::insert([
            'Product_name' => 'ماهی',
            'category_id' => 1,
            'manufacture_id' => 2,
            'Product_short_description' => 'اگر شما در طول روز تماس‌های زیادی دارید و استفاده از گوشی برایتان مقدور نیست، نیاز به هندزفری با کیفیت دارید. هندزفری بلوتوث مدل i7 با طراحی زیبا انتخاب مناسبی برای شما است. این کالا در رنگ طلایی و با الهام گرفتن از ایرپاد اپل طراحی شده است. این هندزفری علاوه بر قابلیت مکالمه تلفنی، به شما امکان کنترل صدا و پخش موسیقی را هم می‌دهد. با استفاده از بلوتوث این محصول به گوشی هوشمند‌تان متصل می‌شود',
            'Product_long_description' => 'امروزه هدفون‌ها با طراحی‌های متفاوت روانه‌ی بازار می‌شوند و ازآنجایی‌که ایرپاد‌های اپل دراین‌بین طرفداران بسیار را به‌سوی خود جلب کرده، شرکت‌های چینی برای جذب مشتری، از روی آن کپی برداری کردند؛ یکی از مدل‌هایی که از اپل ایرپاد کپی‌برداری شده، i7 است. این هدفون برخلاف مدل i7 TWS، یک گوشی دارد. هدفون‌ها بسته به شرایط هر شخص مدت استفاده‌ی متفاوتی دارند و احتمال دارد برخی افراد مدت‌زمان زیادی از آن استفاده کنند و ازاین‌رو طراحی ارگونومیک بسیار حائز اهمیت است. هدفون i7 با بدنه‌ای پلاستیکی، وزن 5 گرمی دارد و در استفاده‌های طولانی‌مدت کاربر را خسته نمی‌کند. این هدفون از نوع توگوشی است و آن به‌طور کامل در داخل گوش قرار می‌گیرد؛ طراحی ارگونومیک باعث شده تا این هدفون‌ به‌راحتی از گوش خارج نشونوزن این کالا 5 گرم است و در استفاده‌های طولانی مدت شما را خسته نخواهد کرد. مدت زمان نگهداری شارژ در حالت اس.',
            'Product_price' => 48050,
            'Product_image' => 'image/ngmDBE1YA8qhGkqvOWzL.jpg',
            'Product_size' => 'small',
            'color_id' => 1,
            'recommended' => 1,
            'Product_status' => 1,
        ]);


    }
}
